
Процедура ОбработкаПроведения(Отказ, Режим)

	//Установим блокировки данных в регистрах
	Движения.УчетДенежныхСредств.БлокироватьДляИзменения = Истина;	
	
	// регистр УчетДенежныхСредств Расход
 	Движения.УчетДенежныхСредств.Записывать = Истина;
		Движение = Движения.УчетДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сумма = СуммаДокумента;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;

	// регистр Основной 
 	Движения.Основной.Записывать = Истина;
		Движение = Движения.Основной.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.РасчетыСПоставщиками;
		Движение.СчетКт = ПланыСчетов.Основной.ДенежныеСредства;
		Движение.Период = Дата;
		Движение.Сумма = СуммаДокумента;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор;
		
		Движения.Записать();
		Если Не ПроверкаОстатковТоваров() Тогда
			Отказ = Истина;
		КонецЕсли;

	КонецПроцедуры
	
Функция ПроверкаОстатковТоваров() Экспорт
	  
	  Результат = Истина;
	  
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
		|	ДенежныеСредстваОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.УчетДенежныхСредств.Остатки КАК ДенежныеСредстваОстатки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.СуммаОстаток < 0 Тогда
		Результат = Ложь;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не хватает " + "" + Строка (-Выборка.СуммаОстаток)
		+ "денежных средств для списания!";
		Сообщение.Сообщить();    
		КонецЕсли;
КонецЕсли;		
    Возврат Результат;
    
КонецФункции

