Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Основной.Записывать = Истина;
	Движения.СтоимостьТоваров.Записывать = Истина;
	
	//Установим блокировки данных в регистрах
	Движения.Основной.БлокироватьДляИзменения = Истина;
	Движения.ТоварыНаСкладах.БлокироватьДляИзменения = Истина;	
	Движения.СтоимостьТоваров.БлокироватьДляИзменения = Истина;
	
	//для правильного получения средней стоимости
	Движения.Основной.Записать();
	Движения.ТоварыНаСкладах.Записать();
	Движения.СтоимостьТоваров.Записать();
	
	РезультатТовары = ПолучитьВыборкуТоваров();  
    ТекстрокаТовары = РезультатТовары.Выбрать();
      
    // регистр ТоварыНаСкладах Приход
    //Для Каждого ТекСтрокаТовары Из Товары Цикл   
    Пока ТекСтрокаТовары.Следующий()Цикл
        Движение = Движения.ТоварыНаСкладах.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
		Движение.Склад = Справочники.Cклады.ЦентральныйСклад;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		// регистр СтоимостьТоваров Приход
		Движение = Движения.СтоимостьТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Стоимость = ТекСтрокаТовары.Стоимость * ТекСтрокаТовары.Количество;
		
		// регистр Основной 
		Движение = Движения.Основной.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ТекСтрокаТовары.СчетДт; 
		Движение.СчетКт = ТекСтрокаТовары.СчетКт;
		Движение.КоличествоДт = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		
		Движение.СубконтоДт.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.СубконтоДт.Склады = Склад;
		
		Движение.СубконтоКт.Контрагенты = Контрагент;
		Движение.СубконтоКт.Договоры = Договор;
		
	КонецЦикла;
		Движения.Записать();
		
		СписокНоменклатур = РезультатТовары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		Если Не РаботаСДокументамиСервер.ПроверкаОстатковТоваров(Дата, Склад, СписокНоменклатур) Тогда
			Отказ = Истина;
		КонецЕсли;
		
КонецПроцедуры               

Функция ПолучитьВыборкуТоваров()   
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    Таблица.Номенклатура КАК Номенклатура,
        |    Таблица.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
        |    ВЫБОР
        |        КОГДА Таблица.Номенклатура.ВидНоменклатуры
        |                = ЗНАЧЕНИЕ (Перечисление.ВидНоменклатуры.Товар)
        |            ТОГДА ЗНАЧЕНИЕ (ПланСчетов.Основной.Товары)
		|    КОНЕЦ КАК СчетДт,
        |    ВЫБОР
        |        КОГДА Таблица.Номенклатура.ВидНоменклатуры
        |                = ЗНАЧЕНИЕ (Перечисление.ВидНоменклатуры.Товар)
        |            ТОГДА ЗНАЧЕНИЕ (ПланСчетов.Основной.РасчетыСПокупателями)
        |    КОНЕЦ КАК СчетКт,
        |    СУММА(Таблица.Количество) КАК Количество,
        |    СУММА(Таблица.Сумма) КАК Сумма       
        |ИЗ
        |    Документ.ВозвратОдежды.Товары КАК Таблица
        |ГДЕ
        |    Таблица.Ссылка = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    Таблица.Номенклатура,
        |    Таблица.Номенклатура.ВидНоменклатуры";    
            
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    ТаблицаТоваров = Запрос.Выполнить().Выгрузить();   
    РезультатЗапроса = РаботаСДокументамиСервер.ПолучитьСреднююЦенуДляТаблицыНоменклатур(Дата, ТаблицаТоваров);
 
Возврат РезультатЗапроса;
    
КонецФункции    
