Процедура СообщениеТекущегоВремени() Экспорт

  //Сперва получим наименование нашего задания
  СеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
  ФоновоеЗадание = СеансИнформационнойБазы.ПолучитьФоновоеЗадание();
  РегламентноеЗадание = ФоновоеЗадание.РегламентноеЗадание;
  НаименованиеЗадания = РегламентноеЗадание.Наименование;
  
  Текст = СтрШаблон("Текущее время выполнения регламентного задания %1: %2",
  НаименованиеЗадания,
  ТекущаяДатаСеанса());
  
  ЗаписьЖурналаРегистрации (Текст, УровеньЖурналаРегистрации.Информация,,,
  "Выполнено");
  
КонецПроцедуры

//  Процедура СообщениеТекущегоВремени () Экспорт
//// Сперва получим наименование нашего задания
//СеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
//ФоновоеЗадание = СеансИнформационнойБазы.ПолучитьФоновоеЗадание();
//РегламЗадание = ФоновоеЗадание.РегламентноеЗадание;
//НаименованиеЗадания = РегламЗадание.Наименование;

//Текст = СтрШаблон("Текущее время выполнения регламентного задания %1: %2", 
//	НаименованиеЗадания,
//	ТекущаяДатаСеанса());
//	
//ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Информация,,,
//	"Выполнено"); 	  
//  КонецПроцедуры
  