Функция Сформировать (СтруктураПараметров) Экспорт 
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
 ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСотрудники = Макет.ПолучитьОбласть("Сотрудники");
	
	//ОбластьШапка.Параметры.Организация = Справочники.Организации.НайтиПоКоду("000000001");
	ОбластьШапка.Параметры.Дата = ТекущаяДата();
	ТабличныйДокумент.Вывести(ОбластьШапка); 

	Запрос = Новый Запрос; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагент.Ссылка КАК Ссылка,
	|	Контрагент.УНП КАК УНП,
	|	Контрагент.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагент
	|ГДЕ
	|НЕ Контрагент.ЭтоГруппа И
	|Контрагент.Наименование ПОДОБНО ""%"" + &ЧастьНаименования + ""%"" ";    
	
	
	Запрос.УстановитьПараметр("ЧастьНаименования",СтруктураПараметров.ЧастьНаименования);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Ном = 1;
	Пока Выборка.Следующий()Цикл
		//Заполняем параметры области наших контрагентов
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ОбластьСтрока.Параметры.НомерПП = Ном;
		// Заполняем расшифровку контрагента
		ОбластьСтрока.Параметры.КонтрагентРасшифровка = Выборка.Ссылка; 
		Ном = Ном + 1;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	Возврат ТабличныйДокумент; 
КонецФункции	











