
Процедура ПечатьАкта(ТабДок, Ссылка) Экспорт
	Макет = Документы.РемонтОдежды.ПолучитьМакет("ПечатьАКТА");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РемонтОдежды.Дата,
	|	РемонтОдежды.Договор,
	|	РемонтОдежды.Исполнитель,
	|	РемонтОдежды.Контрагент,
	|	РемонтОдежды.Номер,
	|	РемонтОдежды.Организация,
	|	РемонтОдежды.Склад,
	|	РемонтОдежды.СрокИсполнения,
	|	РемонтОдежды.СуммаДокумента,
	|	РемонтОдежды.Ремонт.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Стоимость,
	|		Цена,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РемонтОдежды КАК РемонтОдежды
	|ГДЕ
	|	РемонтОдежды.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьРемонтШапка = Макет.ПолучитьОбласть("РемонтШапка");
	ОбластьЗаголовок.Параметры.Дата = ТекущаяДата();
	ОбластьРемонт = Макет.ПолучитьОбласть("Ремонт");
    ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьРемонтШапка);
		ВыборкаРемонт = Выборка.Ремонт.Выбрать();
		СуммаИтого = 0;
		Пока ВыборкаРемонт.Следующий() Цикл
			ОбластьРемонт.Параметры.Заполнить(ВыборкаРемонт);
			ТабДок.Вывести(ОбластьРемонт, ВыборкаРемонт.Уровень());
			СуммаИтого = СуммаИтого + ВыборкаРемонт.Сумма;
		КонецЦикла;

		ОбластьИтого.Параметры.СуммаИтого = СуммаИтого;
		ТабДок.Вывести(ОбластьИтого);
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры   
















