

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.СтоимостьТоваров.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Движения.Основной.Записывать = Истина;
	
	//Установим блокировки данных в регистрах
	Движения.ТоварыНаСкладах.БлокироватьДляИзменения = Истина;	
	Движения.СтоимостьТоваров.БлокироватьДляИзменения = Истина;
	
	//для правильного получения средней стоимости
	Движения.ТоварыНаСкладах.Записать();
	Движения.СтоимостьТоваров.Записать();
	
	
	РезультатРемонт = ПолучитьВыборкуТоваров();  
	ТекСтрокаРемонт = РезультатРемонт.Выбрать();
	
	
	Пока ТекСтрокаРемонт.Следующий() Цикл
	//Для Каждого ТекСтрокаРемонт Из Ремонт Цикл
		Если ТекСтрокаРемонт.ВидНоменклатуры <> Перечисления.ВидНоменклатуры.Услуга Тогда
	// регистр ТоварыНаСкладах Расход
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаРемонт.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаРемонт.Количество;

	// регистр СтоимостьТоваров Расход
		Движение = Движения.СтоимостьТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаРемонт.Номенклатура;
		Движение.Стоимость = ТекСтрокаРемонт.Стоимость * ТекСтрокаРемонт.Количество;

	// регистр Продажи 
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Номенклатура = ТекСтрокаРемонт.Номенклатура;
		Движение.Сумма = ТекСтрокаРемонт.Сумма;
		Движение.Количество = ТекСтрокаРемонт.Количество; 
		Движение.Менеджер = Исполнитель;

	// регистр Основнойдт90-кт41 / дт90-кт10
		Движение = Движения.Основной.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ТекСтрокаРемонт.СчетДт;   
		Движение.СчетКт = ТекСтрокаРемонт.СчетКт;
		Движение.КоличествоКт = ТекСтрокаРемонт.Количество;		
		Движение.Сумма = ТекСтрокаРемонт.Стоимость * ТекСтрокаРемонт.Количество ;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ТекСтрокаРемонт.Номенклатура;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
		
			КонецЕсли;	
		КонецЦикла;	
		
		// регистр Основной  дт62- кт90
		Движение = Движения.Основной.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ПланыСчетов.Основной.РасчетыСПокупателями;
		Движение.СчетКт = ПланыСчетов.Основной.Капитал;
		Движение.СубконтоДт.Контрагенты = Контрагент;
		Движение.СубконтоДт.Договоры = Договор;
		Движение.Сумма = СуммаДокумента;



		Движения.Записать();

		СписокНоменклатур = РезультатРемонт.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		Если Не РаботаСДокументамиСервер.ПроверкаОстатковТоваров(Дата, Склад, СписокНоменклатур) Тогда
			Отказ = Истина;
		КонецЕсли;


КонецПроцедуры

Функция ПолучитьВыборкуТоваров()  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
   	|    Таблица.Номенклатура КАК Номенклатура,
	|    Таблица.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|    ЗНАЧЕНИЕ (ПланСчетов.Основной.Капитал) КАК СчетДт,
	|    ВЫБОР
	|        КОГДА Таблица.Номенклатура.ВидНоменклатуры
	|                = ЗНАЧЕНИЕ (Перечисление.ВидНоменклатуры.Материал)
	|            ТОГДА ЗНАЧЕНИЕ (ПланСчетов.Основной.Материалы)
	|        ИНАЧЕ ЗНАЧЕНИЕ (ПланСчетов.Основной.Товары)
	|    КОНЕЦ КАК СчетКт,
	|    СУММА(Таблица.Количество) КАК Количество,
	|    СУММА(Таблица.Сумма) КАК Сумма       
	|ИЗ
	|    Документ.РемонтОдежды.Ремонт КАК Таблица
	|ГДЕ
	|    Таблица.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|    Таблица.Номенклатура,
	|    Таблица.Номенклатура.ВидНоменклатуры";    
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();   
	РезультатЗапроса = РаботаСДокументамиСервер.ПолучитьСреднююЦенуДляТаблицыНоменклатур(Дата, ТаблицаТоваров);
	Возврат РезультатЗапроса;
	
КонецФункции          
