Функция Сформировать() Экспорт
	
	Макет = ПолучитьМакет("Макет");  
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	
	ОбластьШапка.Параметры.Организация = РаботаСоСправочниками.ОсновнаяОрганизация();
	ОбластьШапка.Параметры.Дата = ТекущаяДата();
	ТабличныйДокумент.Вывести(ОбластьШапка); 
	
	Выборка = Справочники.Номенклатура.Выбрать();
	Номер = 1;  
	Пока Выборка.Следующий()Цикл  
		Если Выборка.ЭтоГруппа Тогда // мы выбираем группу, в начало списка и словом продолжить ее пропускаем
			Продолжить;
		КонецЕсли;
		ОбластьСтрока.Параметры.Номер = Номер;
		ОбластьСтрока.Параметры.Наименование = Выборка.Наименование;
		ОбластьСтрока.Параметры.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		Номер = Номер + 1; 
		ТабличныйДокумент.Вывести(ОбластьСтрока);		
	КонецЦикла;
	Возврат ТабличныйДокумент;
КонецФункции    