
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр УчетДенежныхСредств Приход
	Движения.УчетДенежныхСредств.Записывать = Истина;
		Движение = Движения.УчетДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сумма = СуммаДокумента;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;

	// регистр Основной 
	Движения.Основной.Записывать = Истина;
		Движение = Движения.Основной.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ПланыСчетов.Основной.ДенежныеСредства;
		Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПокупателями;
		Движение.Сумма = СуммаДокумента;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор;

КонецПроцедуры             
            
   
