&НаКлиенте
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Объект.СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.СтоимостьТоваров.Записывать = Истина;
	Движения.Основной.Записывать = Истина;
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	ПриходнаяНакладнаяТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ПриходнаяНакладнаяТовары.Количество КАК Количество,
	|	ПриходнаяНакладнаяТовары.Цена КАК Цена,
	|	ПриходнаяНакладнаяТовары.Сумма КАК Сумма
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	|ГДЕ
	|	ПриходнаяНакладнаяТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТекСтрокаТовары = Запрос.Выполнить().Выбрать();
	СчетМатериалы = ПланыСчетов.Основной.Материалы;
	СчетТовары = ПланыСчетов.Основной.Товары; 
	
	//Для Каждого ТекСтрокаТовары Из Товары Цикл
	Пока ТекСтрокаТовары.Следующий() Цикл
		
		// регистр ТоварыНаСкладах Приход
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		// регистр СтоимостьТоваров Приход
		Движение = Движения.СтоимостьТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Стоимость = ТекСтрокаТовары.Сумма;	
		
		// регистр бухгалтерии основной дт10 - кт60
		//Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга Тогда
		Если ТекСтрокаТовары.ВидНоменклатуры <> Перечисления.ВидНоменклатуры.Услуга Тогда
			
			Движение = Движения.Основной.Добавить();
			Движение.Период = Дата;
			Если ТекСтрокаТовары.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Материал Тогда
				Движение.СчетДт = СчетМатериалы;
			Иначе
				Движение.СчетДт = СчетТовары; 
			КонецЕсли;
			Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПоставщиками;
			Движение.КоличествоДт = ТекСтрокаТовары.Количество;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			
			Движение.СубконтоДт.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.СубконтоДт.Склады = Склад;
			
			Движение.СубконтоКт.Контрагенты = Контрагент;
			Движение.СубконтоКт.Договоры = Договор;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьВыборкуТоваров()  
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ПриходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
        |    ПриходнаяНакладнаяТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
        |    ВЫБОР
        |        КОГДА ПриходнаяНакладнаяТовары.Номенклатура.ВидНоменклатуры
        |                = ЗНАЧЕНИЕ (Перечисление.ВидНоменклатуры.Материал)
        |            ТОГДА ЗНАЧЕНИЕ (ПланСчетов.Основной.Материалы)
        |        ИНАЧЕ Значение (ПланСчетов.Основной.Товары)
        |    КОНЕЦ КАК СчетДт,
        |    ЗНАЧЕНИЕ (ПланСчетов.Основной.РасчетыСПоставщиками) КАК СчетКт,
        |    СУММА(ПриходнаяНакладнаяТовары.Количество) КАК Количество,
        |    СУММА(ПриходнаяНакладнаяТовары.Сумма) КАК Сумма       
        |ИЗ
        |    Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
        |ГДЕ
        |    ПриходнаяНакладнаяТовары.Ссылка = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    ПриходнаяНакладнаяТовары.Номенклатура,
        |    ПриходнаяНакладнаяТовары.Номенклатура.ВидНоменклатуры";    
            
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
 
Возврат Запрос.Выполнить();
    
КонецФункции          
 




