
&НаКлиенте
Процедура РемонтКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Ремонт.ТекущиеДанные;
	РаботаСДокументами.ПолучитьСуммуСтроки(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура РемонтЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.Ремонт.ТекущиеДанные;
	РаботаСДокументами.ПолучитьСуммуСтроки(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура РемонтПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
		 Объект.СуммаДокумента =  Объект.Ремонт.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура РемонтПослеУдаления(Элемент)
		 Объект.СуммаДокумента =  Объект.Ремонт.Итог("Сумма");

КонецПроцедуры

//Цены номенклатуры           
&НаКлиенте
Процедура РемонтНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Ремонт.ТекущиеДанные;
	ТекущиеДанные.Цена = РаботаСоСправочниками.ЦенаНоменклатуры(Объект.Дата, ТекущиеДанные.Номенклатура);
	РаботаСДокументами.ПолучитьСуммуСтроки(ТекущиеДанные);
КонецПроцедуры

