Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Начисления.Записывать = Истина;

	// регистр Начисления
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаНачисления.ДатаОкончания);
		Движение.ПериодРегистрации = ТекСтрокаНачисления.ДатаНачала;
		Движение.БазовыйПериодНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаНачисления.ДатаОкончания);
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.ИсходныеДанные = ТекСтрокаНачисления.Начислено;
		Движение.ГрафикРаботы = ТекСтрокаНачисления.ГрафикРаботы;
	КонецЦикла;

// Записываем движения
Движения.Начисления.Записать();

Запрос = Новый Запрос;
Запрос.Текст =
		"ВЫБРАТЬ
		|	НачислениеЗаработнойПлатыНачисления.Сотрудник КАК Сотрудник
		|ИЗ
		|	Документ.НачислениеЗаработнойПлаты.Начисления КАК НачислениеЗаработнойПлатыНачисления
		|ГДЕ
		|	НачислениеЗаработнойПлатыНачисления.Ссылка = &Ссылка";
Запрос.УстановитьПараметр("Ссылка", Ссылка);

// Сформируем массив сотрудников
ТаблицаСотрудников = Запрос.Выполнить().Выгрузить();
МассивСотрудников = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");

// Расчет оклада
РасчетЗарплаты.РассчитатьНачисления(Движения.Начисления, 
	ПланыВидовРасчета.ОсновныеНачисления.Оклад, 
	МассивСотрудников);
Движения.Начисления.Записать(, Истина); // не выполняем перерасчет

// Расчет премии
РасчетЗарплаты.РассчитатьНачисления(Движения.Начисления, 
	ПланыВидовРасчета.ОсновныеНачисления.Премия, 
	МассивСотрудников);
Движения.Начисления.Записать(, Истина); // не выполняем перерасчет

КонецПроцедуры
