
&НаСервере
Функция  ЦенаНоменклатуры (ДатаЦены, ВыбраннаяНоменклатура) Экспорт
	Отбор = Новый Структура ("Номенклатура", ВыбраннаяНоменклатура);
	ЗначенияРесурсов = РегистрыСведений.ЦенаНоменклатуры.ПолучитьПоследнее(ДатаЦены,Отбор);
	Возврат ЗначенияРесурсов.Цена;
КонецФункции

Функция  ПолучитьСписокВидовНоменклатур () Экспорт
	СписокЗначенияПеречисления = Новый СписокЗначений;
	
	Для каждого Элемент из Перечисления.ВидыНоменклатуры Цикл
		СписокЗначенияПеречисления.Добавить(Элемент);
	КонецЦикла;
		Возврат СписокЗначенияПеречисления;
КонецФункции

Функция  ОсновнаяОрганизация () Экспорт
  Возврат  Справочники.Организация.НайтиПоКоду("000000001");	
КонецФункции
